app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "pages".* FROM "pages"
---
  def index
    @articles = Article.all
    @pages = Page.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "view_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["view_count", 1], ["updated_at", "2015-10-29 14:33:57.524283"], ["id", 2]]
---
  def show
    @article = Article.find(params[:id])
    @article.view_count += 1
    @article.save

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Słowo jest nicością"], ["body", "Czyny światło niosą umierającym światom."], ["created_at", "2015-10-27 20:28:39.894524"], ["updated_at", "2015-10-27 20:28:39.894524"]]
---
  def create
    @article = Article.create(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2015-10-28 19:05:19.195608"], ["image_file_name", "3947959-anakin-skywalker-force-choke.jpg"], ["updated_at", "2015-10-28 19:05:19.224331"], ["id", 10]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)

SELECT "articles".* FROM "articles"
---
  def popular
    @articles = Article.all.sort { |x,y| y.view_count <=> x.view_count }.slice(0,3)

SELECT "articles".* FROM "articles"
---
  def archive
    @articles = Article.all