app/controllers/pages_controller.rb

INSERT INTO "pages" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "About"], ["body", "My name is Mat. I'm rising rubyist and Manchester United supporter."], ["created_at", "2015-10-30 17:01:35.611774"], ["updated_at", "2015-10-30 17:01:35.611774"]]
---
  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
  def destroy
    @page.destroy

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_page
      @page = Page.find(params[:id])